markjfisher/fujinet-hal-rust/sdkconfig.defaults.fn
#####################################################
# The "default" configuration from fujinet-firmware project.
#####################################################

# Speed up configs
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
#CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y

# removes all logging of the application, but makes you blind...
# CONFIG_LOG_DEFAULT_LEVEL_NONE=y

CONFIG_RTC_CLK_SRC_INT_RC=y
CONFIG_RTC_CLK_CAL_CYCLES=0
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768

CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

#####################################################
# Standard config
#####################################################

#
# Log output
#
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
# enable this to see nothing below error logging
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
# CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
CONFIG_LOG_DEFAULT_LEVEL=1
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# CONFIG_LOG_MAXIMUM_LEVEL_WARN is not set
# CONFIG_LOG_MAXIMUM_LEVEL_INFO is not set
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
CONFIG_LOG_MAXIMUM_LEVEL=1
# CONFIG_LOG_COLORS is not set
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Log output


#########################################################################################

# CONFIG_SOC_BROWNOUT_RESET_SUPPORTED="Not determined"
# CONFIG_SOC_TWAI_BRP_DIV_SUPPORTED="Not determined"
# CONFIG_SOC_DPORT_WORKAROUND="Not determined"
# CONFIG_SOC_CAPS_ECO_VER_MAX=301
# CONFIG_SOC_ADC_SUPPORTED=y
# CONFIG_SOC_DAC_SUPPORTED=y
# CONFIG_SOC_MCPWM_SUPPORTED=y
# CONFIG_SOC_SDMMC_HOST_SUPPORTED=y
# CONFIG_SOC_BT_SUPPORTED=y
# CONFIG_SOC_PCNT_SUPPORTED=y
# CONFIG_SOC_WIFI_SUPPORTED=y
# CONFIG_SOC_SDIO_SLAVE_SUPPORTED=y
# CONFIG_SOC_TWAI_SUPPORTED=y
# CONFIG_SOC_EMAC_SUPPORTED=y
# CONFIG_SOC_ULP_SUPPORTED=y
# CONFIG_SOC_CCOMP_TIMER_SUPPORTED=y
# CONFIG_SOC_RTC_FAST_MEM_SUPPORTED=y
# CONFIG_SOC_RTC_SLOW_MEM_SUPPORTED=y
# CONFIG_SOC_RTC_MEM_SUPPORTED=y
# CONFIG_SOC_I2S_SUPPORTED=y
# CONFIG_SOC_RMT_SUPPORTED=y
# CONFIG_SOC_SDM_SUPPORTED=y
# CONFIG_SOC_SUPPORT_COEXISTENCE=y
# CONFIG_SOC_AES_SUPPORTED=y
# CONFIG_SOC_MPI_SUPPORTED=y
# CONFIG_SOC_SHA_SUPPORTED=y
# CONFIG_SOC_FLASH_ENC_SUPPORTED=y
# CONFIG_SOC_SECURE_BOOT_SUPPORTED=y
# CONFIG_SOC_TOUCH_SENSOR_SUPPORTED=y
# CONFIG_SOC_DPORT_WORKAROUND_DIS_INTERRUPT_LVL=5
# CONFIG_SOC_XTAL_SUPPORT_26M=y
# CONFIG_SOC_XTAL_SUPPORT_40M=y
# CONFIG_SOC_XTAL_SUPPORT_AUTO_DETECT=y
# CONFIG_SOC_ADC_RTC_CTRL_SUPPORTED=y
# CONFIG_SOC_ADC_DIG_CTRL_SUPPORTED=y
# CONFIG_SOC_ADC_DMA_SUPPORTED=y
# CONFIG_SOC_ADC_PERIPH_NUM=2
# CONFIG_SOC_ADC_MAX_CHANNEL_NUM=10
# CONFIG_SOC_ADC_ATTEN_NUM=4
# CONFIG_SOC_ADC_DIGI_CONTROLLER_NUM=2
# CONFIG_SOC_ADC_PATT_LEN_MAX=16
# CONFIG_SOC_ADC_DIGI_MIN_BITWIDTH=9
# CONFIG_SOC_ADC_DIGI_MAX_BITWIDTH=12
# CONFIG_SOC_ADC_DIGI_RESULT_BYTES=2
# CONFIG_SOC_ADC_DIGI_DATA_BYTES_PER_CONV=4
# CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_HIGH=2
# CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_LOW=20
# CONFIG_SOC_ADC_RTC_MIN_BITWIDTH=9
# CONFIG_SOC_ADC_RTC_MAX_BITWIDTH=12
# CONFIG_SOC_RTC_SLOW_CLOCK_SUPPORT_8MD256=y
# CONFIG_SOC_SHARED_IDCACHE_SUPPORTED=y
# CONFIG_SOC_MMU_LINEAR_ADDRESS_REGION_NUM=5
# CONFIG_SOC_CPU_CORES_NUM=2
# CONFIG_SOC_CPU_INTR_NUM=32
# CONFIG_SOC_CPU_HAS_FPU=y
# CONFIG_SOC_CPU_BREAKPOINTS_NUM=2
# CONFIG_SOC_CPU_WATCHPOINTS_NUM=2
# CONFIG_SOC_CPU_WATCHPOINT_SIZE=64
# CONFIG_SOC_DAC_PERIPH_NUM=2
# CONFIG_SOC_DAC_RESOLUTION=8
# CONFIG_SOC_GPIO_PORT=1
# CONFIG_SOC_GPIO_PIN_COUNT=40
# CONFIG_SOC_GPIO_VALID_GPIO_MASK=0xFFFFFFFFFF
# CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0xEF0FEA
# CONFIG_SOC_I2C_NUM=2
# CONFIG_SOC_I2C_FIFO_LEN=32
# CONFIG_SOC_I2C_SUPPORT_SLAVE=y
# CONFIG_SOC_I2C_SUPPORT_APB=y
# CONFIG_SOC_CLK_APLL_SUPPORTED=y
# CONFIG_SOC_APLL_MULTIPLIER_OUT_MIN_HZ=350000000
# CONFIG_SOC_APLL_MULTIPLIER_OUT_MAX_HZ=500000000
# CONFIG_SOC_APLL_MIN_HZ=5303031
# CONFIG_SOC_APLL_MAX_HZ=125000000
# CONFIG_SOC_I2S_NUM=2
# CONFIG_SOC_I2S_HW_VERSION_1=y
# CONFIG_SOC_I2S_SUPPORTS_APLL=y
# CONFIG_SOC_I2S_SUPPORTS_PDM=y
# CONFIG_SOC_I2S_SUPPORTS_PDM_TX=y
# CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
# CONFIG_SOC_I2S_SUPPORTS_ADC_DAC=y
# CONFIG_SOC_I2S_SUPPORTS_ADC=y
# CONFIG_SOC_I2S_SUPPORTS_DAC=y
# CONFIG_SOC_I2S_SUPPORTS_LCD_CAMERA=y
# CONFIG_SOC_I2S_TRANS_SIZE_ALIGN_WORD=y
# CONFIG_SOC_I2S_LCD_I80_VARIANT=y
# CONFIG_SOC_LCD_I80_SUPPORTED=y
# CONFIG_SOC_LCD_I80_BUSES=2
# CONFIG_SOC_LCD_I80_BUS_WIDTH=24
# CONFIG_SOC_LEDC_HAS_TIMER_SPECIFIC_MUX=y
# CONFIG_SOC_LEDC_SUPPORT_APB_CLOCK=y
# CONFIG_SOC_LEDC_SUPPORT_REF_TICK=y
# CONFIG_SOC_LEDC_SUPPORT_HS_MODE=y
# CONFIG_SOC_LEDC_CHANNEL_NUM=8
# CONFIG_SOC_LEDC_TIMER_BIT_WIDE_NUM=20
# CONFIG_SOC_MCPWM_GROUPS=2
# CONFIG_SOC_MCPWM_TIMERS_PER_GROUP=3
# CONFIG_SOC_MCPWM_OPERATORS_PER_GROUP=3
# CONFIG_SOC_MCPWM_COMPARATORS_PER_OPERATOR=2
# CONFIG_SOC_MCPWM_GENERATORS_PER_OPERATOR=2
# CONFIG_SOC_MCPWM_TRIGGERS_PER_OPERATOR=2
# CONFIG_SOC_MCPWM_GPIO_FAULTS_PER_GROUP=3
# CONFIG_SOC_MCPWM_CAPTURE_TIMERS_PER_GROUP=y
# CONFIG_SOC_MCPWM_CAPTURE_CHANNELS_PER_TIMER=3
# CONFIG_SOC_MCPWM_GPIO_SYNCHROS_PER_GROUP=3
# CONFIG_SOC_MPU_MIN_REGION_SIZE=0x20000000
# CONFIG_SOC_MPU_REGIONS_MAX_NUM=8
# CONFIG_SOC_PCNT_GROUPS=1
# CONFIG_SOC_PCNT_UNITS_PER_GROUP=8
# CONFIG_SOC_PCNT_CHANNELS_PER_UNIT=2
# CONFIG_SOC_PCNT_THRES_POINT_PER_UNIT=2
# CONFIG_SOC_RMT_GROUPS=1
# CONFIG_SOC_RMT_TX_CANDIDATES_PER_GROUP=8
# CONFIG_SOC_RMT_RX_CANDIDATES_PER_GROUP=8
# CONFIG_SOC_RMT_CHANNELS_PER_GROUP=8
# CONFIG_SOC_RMT_MEM_WORDS_PER_CHANNEL=64
# CONFIG_SOC_RMT_SUPPORT_REF_TICK=y
# CONFIG_SOC_RMT_SUPPORT_APB=y
# CONFIG_SOC_RMT_CHANNEL_CLK_INDEPENDENT=y
# CONFIG_SOC_RTCIO_PIN_COUNT=18
# CONFIG_SOC_RTCIO_INPUT_OUTPUT_SUPPORTED=y
# CONFIG_SOC_RTCIO_HOLD_SUPPORTED=y
# CONFIG_SOC_RTCIO_WAKE_SUPPORTED=y
# CONFIG_SOC_SDM_GROUPS=1
# CONFIG_SOC_SDM_CHANNELS_PER_GROUP=8
# CONFIG_SOC_SPI_HD_BOTH_INOUT_SUPPORTED=y
# CONFIG_SOC_SPI_AS_CS_SUPPORTED=y
# CONFIG_SOC_SPI_PERIPH_NUM=3
# CONFIG_SOC_SPI_DMA_CHAN_NUM=2
# CONFIG_SOC_SPI_MAX_CS_NUM=3
# CONFIG_SOC_SPI_MAXIMUM_BUFFER_SIZE=64
# CONFIG_SOC_SPI_MAX_PRE_DIVIDER=8192
# CONFIG_SOC_MEMSPI_SRC_FREQ_80M_SUPPORTED=y
# CONFIG_SOC_MEMSPI_SRC_FREQ_40M_SUPPORTED=y
# CONFIG_SOC_MEMSPI_SRC_FREQ_26M_SUPPORTED=y
# CONFIG_SOC_MEMSPI_SRC_FREQ_20M_SUPPORTED=y
# CONFIG_SOC_TIMER_GROUPS=2
# CONFIG_SOC_TIMER_GROUP_TIMERS_PER_GROUP=2
# CONFIG_SOC_TIMER_GROUP_COUNTER_BIT_WIDTH=64
# CONFIG_SOC_TIMER_GROUP_TOTAL_TIMERS=4
# CONFIG_SOC_TIMER_GROUP_SUPPORT_APB=y
# CONFIG_SOC_TOUCH_VERSION_1=y
# CONFIG_SOC_TOUCH_SENSOR_NUM=10
# CONFIG_SOC_TOUCH_PAD_MEASURE_WAIT_MAX=0xFF
# CONFIG_SOC_TWAI_BRP_MIN=2
# CONFIG_SOC_TWAI_SUPPORT_MULTI_ADDRESS_LAYOUT=y
# CONFIG_SOC_UART_NUM=3
# CONFIG_SOC_UART_SUPPORT_APB_CLK=y
# CONFIG_SOC_UART_SUPPORT_REF_TICK=y
# CONFIG_SOC_UART_FIFO_LEN=128
# CONFIG_SOC_UART_BITRATE_MAX=5000000
# CONFIG_SOC_SPIRAM_SUPPORTED=y
# CONFIG_SOC_SPI_MEM_SUPPORT_CONFIG_GPIO_BY_EFUSE=y
# CONFIG_SOC_SHA_SUPPORT_PARALLEL_ENG=y
# CONFIG_SOC_SHA_SUPPORT_SHA1=y
# CONFIG_SOC_SHA_SUPPORT_SHA256=y
# CONFIG_SOC_SHA_SUPPORT_SHA384=y
# CONFIG_SOC_SHA_SUPPORT_SHA512=y
# CONFIG_SOC_RSA_MAX_BIT_LEN=4096
# CONFIG_SOC_AES_SUPPORT_AES_128=y
# CONFIG_SOC_AES_SUPPORT_AES_192=y
# CONFIG_SOC_AES_SUPPORT_AES_256=y
# CONFIG_SOC_SECURE_BOOT_V1=y
# CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=y
# CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=32
# CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# CONFIG_SOC_PM_SUPPORT_EXT_WAKEUP=y
# CONFIG_SOC_PM_SUPPORT_TOUCH_SENSOR_WAKEUP=y
# CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# CONFIG_SOC_PM_SUPPORT_RTC_FAST_MEM_PD=y
# CONFIG_SOC_PM_SUPPORT_RTC_SLOW_MEM_PD=y
# CONFIG_SOC_PM_SUPPORT_MODEM_PD=y
# CONFIG_SOC_SDMMC_USE_IOMUX=y
# CONFIG_SOC_SDMMC_NUM_SLOTS=2
# CONFIG_SOC_WIFI_WAPI_SUPPORT=y
# CONFIG_SOC_WIFI_CSI_SUPPORT=y
# CONFIG_SOC_WIFI_MESH_SUPPORT=y
# CONFIG_SOC_BLE_SUPPORTED=y
# CONFIG_SOC_BLE_MESH_SUPPORTED=y
# CONFIG_SOC_BT_CLASSIC_SUPPORTED=y
# CONFIG_IDF_CMAKE=y
# CONFIG_IDF_TARGET_ARCH_XTENSA=y
# CONFIG_IDF_TARGET_ARCH="xtensa"
# CONFIG_IDF_TARGET="esp32s3"
# CONFIG_IDF_TARGET_ESP32S3=y
# CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

#
# Build type
#
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# CONFIG_APP_BUILD_TYPE_ELF_RAM is not set
CONFIG_APP_BUILD_GENERATE_BINARIES=y
CONFIG_APP_BUILD_BOOTLOADER=y
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# CONFIG_APP_NO_BLOBS is not set
# CONFIG_APP_COMPATIBLE_PRE_V2_1_BOOTLOADERS is not set
# CONFIG_APP_COMPATIBLE_PRE_V3_1_BOOTLOADERS is not set
# end of Build type


#
# Bootloader config
#
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x1000
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_INFO is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
CONFIG_BOOTLOADER_LOG_LEVEL=0
# CONFIG_BOOTLOADER_SPI_CUSTOM_WP_PIN is not set
CONFIG_BOOTLOADER_SPI_WP_PIN=7
CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_9V=y
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# CONFIG_BOOTLOADER_APP_TEST is not set
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
# CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE is not set
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP is not set
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS is not set
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=y
# end of Bootloader config

#
# Security features
#
CONFIG_SECURE_BOOT_V1_SUPPORTED=y
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# CONFIG_SECURE_BOOT is not set
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# end of Security features

#
# Application manager
#
CONFIG_APP_COMPILE_TIME_DATE=y
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
# end of Application manager

CONFIG_ESP_ROM_HAS_CRC_LE=y
CONFIG_ESP_ROM_HAS_CRC_BE=y
CONFIG_ESP_ROM_HAS_MZ_CRC32=y
CONFIG_ESP_ROM_HAS_JPEG_DECODE=y
CONFIG_ESP_ROM_NEEDS_SWSETUP_WORKAROUND=y


#
# Serial flasher config
#
# CONFIG_ESPTOOLPY_NO_STUB is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# CONFIG_ESPTOOLPY_FLASHFREQ_26M is not set
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
CONFIG_ESPTOOLPY_BEFORE="default_reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
CONFIG_ESPTOOLPY_AFTER="hard_reset"
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_SINGLE_APP=y
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_CUSTOM is not set
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# CONFIG_COMPILER_CXX_RTTI is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_NONE is not set
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
CONFIG_COMPILER_STACK_CHECK=y
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# end of Compiler options

#
# Application Level Tracing
#
# CONFIG_APPTRACE_DEST_JTAG is not set
CONFIG_APPTRACE_DEST_NONE=y
# CONFIG_APPTRACE_DEST_UART1 is not set
# CONFIG_APPTRACE_DEST_UART2 is not set
CONFIG_APPTRACE_DEST_UART_NONE=y
CONFIG_APPTRACE_UART_TASK_PRIO=1
CONFIG_APPTRACE_LOCK_ENABLE=y
# end of Application Level Tracing

#
# Legacy ADC Configuration
#
CONFIG_ADC_DISABLE_DAC=y
# CONFIG_ADC_SUPPRESS_DEPRECATE_WARN is not set


#
# Legacy ADC Calibration Configuration
#
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y
CONFIG_ADC_CAL_LUT_ENABLE=y
# CONFIG_ADC_CALI_SUPPRESS_DEPRECATE_WARN is not set
# end of Legacy ADC Calibration Configuration
# end of Legacy ADC Configuration

#
# SPI Configuration
#
# CONFIG_SPI_MASTER_IN_IRAM is not set
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
# CONFIG_SPI_SLAVE_IN_IRAM is not set
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
# end of SPI Configuration

#
# TWAI Configuration
#
# CONFIG_TWAI_ISR_IN_IRAM is not set
CONFIG_TWAI_ERRATA_FIX_BUS_OFF_REC=y
CONFIG_TWAI_ERRATA_FIX_TX_INTR_LOST=y
CONFIG_TWAI_ERRATA_FIX_RX_FRAME_INVALID=y
CONFIG_TWAI_ERRATA_FIX_RX_FIFO_CORRUPT=y
CONFIG_TWAI_ERRATA_FIX_LISTEN_ONLY_DOM=y
# end of TWAI Configuration

#
# UART Configuration
#
# CONFIG_UART_ISR_IN_IRAM is not set
# end of UART Configuration

#
# GPIO Configuration
#
# CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL is not set
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of GPIO Configuration

#
# Sigma Delta Modulator Configuration
#
# CONFIG_SDM_CTRL_FUNC_IN_IRAM is not set
# CONFIG_SDM_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_SDM_ENABLE_DEBUG_LOG is not set
# end of Sigma Delta Modulator Configuration

#
# GPTimer Configuration
#
# CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM is not set
# CONFIG_GPTIMER_ISR_IRAM_SAFE is not set
# CONFIG_GPTIMER_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_GPTIMER_ENABLE_DEBUG_LOG is not set
# end of GPTimer Configuration

#
# PCNT Configuration
#
# CONFIG_PCNT_CTRL_FUNC_IN_IRAM is not set
# CONFIG_PCNT_ISR_IRAM_SAFE is not set
# CONFIG_PCNT_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_PCNT_ENABLE_DEBUG_LOG is not set
# end of PCNT Configuration

#
# RMT Configuration
#
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# CONFIG_RMT_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# end of RMT Configuration

#
# MCPWM Configuration
#
# CONFIG_MCPWM_ISR_IRAM_SAFE is not set
# CONFIG_MCPWM_CTRL_FUNC_IN_IRAM is not set
# CONFIG_MCPWM_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_MCPWM_ENABLE_DEBUG_LOG is not set
# end of MCPWM Configuration

#
# I2S Configuration
#
# CONFIG_I2S_ISR_IRAM_SAFE is not set
# CONFIG_I2S_SUPPRESS_DEPRECATE_WARN is not set
# CONFIG_I2S_ENABLE_DEBUG_LOG is not set
# end of I2S Configuration
# end of Driver Configurations

#
# eFuse Bit Manager
#
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# CONFIG_EFUSE_VIRTUAL is not set
# CONFIG_EFUSE_CODE_SCHEME_COMPAT_NONE is not set
CONFIG_EFUSE_CODE_SCHEME_COMPAT_3_4=y
# CONFIG_EFUSE_CODE_SCHEME_COMPAT_REPEAT is not set
CONFIG_EFUSE_MAX_BLK_LEN=192
# end of eFuse Bit Manager

#
# ESP-TLS
#
CONFIG_ESP_TLS_USING_MBEDTLS=y
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# CONFIG_ESP_TLS_SERVER is not set
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# end of ESP-TLS

#
# ADC and ADC Calibration
#
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM is not set
# CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE is not set

#
# ADC Calibration Configurations
#
CONFIG_ADC_CALI_EFUSE_TP_ENABLE=y
CONFIG_ADC_CALI_EFUSE_VREF_ENABLE=y
CONFIG_ADC_CALI_LUT_ENABLE=y
# end of ADC Calibration Configurations

CONFIG_ADC_DISABLE_DAC_OUTPUT=y
# end of ADC and ADC Calibration

#
# Common ESP-related
#
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
CONFIG_ESP_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of Common ESP-related

#
# Ethernet
#
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
# CONFIG_ETH_RMII_CLK_OUTPUT is not set
CONFIG_ETH_RMII_CLK_IN_GPIO=0
CONFIG_ETH_DMA_BUFFER_SIZE=512
CONFIG_ETH_DMA_RX_BUFFER_NUM=10
CONFIG_ETH_DMA_TX_BUFFER_NUM=10
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_DM9051=y
# CONFIG_ETH_SPI_ETHERNET_W5500 is not set
# CONFIG_ETH_SPI_ETHERNET_KSZ8851SNL is not set
# CONFIG_ETH_USE_OPENETH is not set
# CONFIG_ETH_TRANSMIT_MUTEX is not set
# end of Ethernet

#
# Event Loop Library
#
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
CONFIG_ESP_EVENT_POST_FROM_ISR=y
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# GDB Stub
#
# end of GDB Stub

